<!doctype html>
<html lang="en-US">
<head>
<title> Про Геймдизайнера</title>
<meta charset="utf-8">
<meta name="description" content="RPCS3 is a multi-platform open-source Sony PlayStation 3 emulator and debugger written in C++ for Windows, Linux and BSD.">
<meta name="keywords" content="rpcs3, playstation, playstation 3, ps3, emulator, debugger, windows, linux, bsd, open source, nekotekina, kd11, faq">
<meta name="author" content="RPCS3">
<meta name="copyright" content="RPCS3">
<?php include 'lib/module/sys-meta.php';?>
<?php include 'lib/module/sys-css.php';?>
<?php include 'lib/module/sys-js.php';?>
</head>
<body>
<?php include 'lib/module/sys-php.php';?>
<div class="page-con-content">
	<div class="banner-con-container darkmode-header">
		<div id="object-particles">
		</div>
		<div class="wavebar-con-container">
			<div class="wavebar-con-wrap">
			  <div class="wavebar-svg-object"></div>
			  <div class="wavebar-svg-object"></div>
			</div>
		</div>
		<div class='banner-con-title fade-up-onstart'>
			<div class='banner-tx1-title fade-up-onstart pulsate'>
				<h1>Кто такой гейм-дизайнер </h1>
			</div>
			<div class='banner-tx2-title fade-up-onstart'>
				<p>
					 Многие думают, что гейм-дизайнер — это человек, который рисует игры. Рассказываем, кто это на самом деле и почему он занимается не только дизайном. <p>ВНИМАНИЕ ОЧЕНЬ МНОГО БУКАВ!!!<br>
				</p>
			</div>
		</div>
	</div>
	<div class="page-con-container">
		<div class="page-in-container">
			<div class='container-con-block darkmode-block'>
				<div class='container-con-wrapper'>
					<div class='container-tx1-block darkmode-txt'>
						<h2>Чем занимается гейм-дизайнер</h2>
					</div>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Хотя история компьютерных игр началась еще в 1940-х годах, в этой сфере до сих пор нет единообразия и ясных определений для многих вещей. Например, в некоторых компаниях может быть позиция гейм-директора (игрового режиссера), а в других его задачи будут распределены между другими специалистами.</a>
						</p>
						<p><br>
					</div>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 То же самое касается и гейм-дизайнера — его задачи могут отличаться от студии к студии. В этой статье мы расскажем о гейм-дизайнере небольших компаний или инди-команд, который вдобавок может выполнять обязанности менеджера продукта, продюсера и других специалистов.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Работы у гейм-дизайнера много: от придумывания идеи игры до контроля работы программистов, дизайнеров, сценаристов, маркетологов, художников, аниматоров и других специалистов.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Его работа над проектом начинается с создания концепта. Чтобы создать хороший концепт, гейм-дизайнер должен не только много играть (как в старые, так и в новые игры), но и постоянно анализировать рынок, чтобы быть в курсе последних событий в геймдеве (от англ. Game Development — разработка игр).</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Для игры он должен в деталях продумать:
							 <p>- механики;<br><p>- графику;<br><p>- сюжет;<br><p>- персонажей;<br><p>- баланс;<br><p>- сеттинг (фантастика, космоопера, стимпанк, киберпанк);<br><p>- геймплей.<br></a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Все эти элементы составляют концепт. Когда он готов, нужно несколько раз его проверить. Гейм-дизайнер должен определить, какой аудитории будет интересна такая игра и будет ли интересна вообще. Если подходящей аудитории не нашлось, концепт придется переделать.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Чтобы игра приносила прибыль, нужно продумать:
							<p>- способы продвижения;<br>
						    <p>- способ заработка на игре;<br>
						    <p>- вопросы защиты;<br>
						    <p>- источники инвестиций.<br>
						    </a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Собрав информацию и обозначив идеи, гейм-дизайнер составляет концепт-документ — в нем содержится вся важная информация об игре. Концепт-документ должен быть подробным, но простым и понятным.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Питч — это презентация, в которой будущая игра красочно описывается. Питч нужен,  чтобы заинтересовать инвесторов или людей на краудфандинговых сервисах вроде Kickstarter или его российском аналоге Boomstarter. К питчу прилагаются все материалы, которые могут произвести впечатление на инвесторов. Питч должен быть сравнительно коротким (примерно 5 страниц), чтобы читатель мог узнать всё самое важное и не заскучать от обилия информации.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Когда инвесторы найдены, гейм-дизайнер составляет дизайн-документ. В нем нужно очень подробно описать вообще всё, что касается игры и ее разработки.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Читать дизайн-документ будет команда, там подробно описаны задачи каждого участника. Например, элементы, которые должны отрисовать художники, — текстуры, спрайты, анимации, шрифты, визуальные эффекты и так далее. Каждый член команды должен понимать задачи всех остальных специалистов.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Например, программист из дизайн-документа должен понять не только какой код он будет писать, но и как ему добавлять в игру спрайты или 3D-модели. То есть в дизайн-документе описывается работа команды в целом. Более частная информация передается специалистам в виде технического задания.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Самая важная работа гейм-дизайнера — довести проект до конца. И для этого он должен решать все возникающие проблемы: готовить новые ТЗ, определять, что поменять в игре, чтобы хватило бюджета и возможностей, и так далее. Также он следит за соблюдением сроков и за многим другим.</a>
						</p>
					</div>
					<p><br>

					<div class='container-tx1-block darkmode-txt'>
						<h2>Что еще должен знать гейм-дизайнер</h2>
					</div>
					

					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Гейм-дизайнер должен иметь представление об основных платформах, для которых создаются игры, и знать, какие инструменты и технологии могут понадобиться.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Например, разрабатывать игры для веба придется сразу на нескольких языках. Интерфейс будет написан на HTML5, CSS3 и JS, а вот для серверной части могут быть использованы разные технологии. Гейм-дизайнер должен понимать, что лучше подойдет для текущего проекта: PHP, ASP.NET, Java, Python или, может быть, Node.JS. Надо знать, почему выбирается именно этот язык, какая на нем скорость разработки, дает ли он все необходимые возможности, легко ли будет поддерживать код и так далее.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Если же игра задумывается для компьютеров или мобильных устройств, то гейм-дизайнеру нужно знать, что лучше использовать — Unity, Unreal Engine или самописный движок. Он должен ясно понимать, какой способ будет дешевле, быстрее и при этом позволит достичь нужного результата.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Другая важная часть работы гейм-дизайнера — менеджмент. Гейм-дизайнер выбирает фреймворк для работы, способ ставить дедлайны, критерии эффективности. Тут тоже пригодится знание всех аспектов создания игры: ему нужно знать, кто не сможет начать работать, пока свои задачи не выполнят другие, — только так можно добиться, чтобы никто не сидел без дела.</a>
						</p>
					</div>
					<div class='container-tx1-block darkmode-txt'>
						<h2>Как стать гейм-дизайнером</h2>
					</div>
					
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Чтобы справиться со всеми задачами, которые описаны выше, гейм-дизайнер должен знать и уметь очень много — настолько, что его работу вряд ли можно считать развлечением. Вот примерный список:

<p>- программирование;<br>
<p>- маркетинг;<br>
<p>- математика;<br>
<p>- написание сценариев;<br>
<p>- управление;<br>
<p>- создание музыки.<br>
</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Никак не обойтись и без самодисциплины. Конечно, всё это не поможет, если гейм-дизайнер не любит игры и не играет в них, но без этих навыков он будет бесполезен, каким бы заядлым геймером ни был.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Проще всего освоить всё это на собственных проектах. Особенно если не хватает денег, чтобы купить или заказать компоненты для игры: тогда инди-разработчику приходится осваивать работу с 2D- или 3D-графикой, программирование, написание музыки и многое другое.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 На это уходит очень много времени, но и навыки развиваются самые разные. А самый, пожалуй, главный — не бросать свои проекты. Ведь без него у начинающего гейм-дизайнера не хватит дисциплины, чтобы еще и руководить кем-то.</a>
						</p>
					</div>
					<div class='container-tx1-block darkmode-txt'>
						<h2>Как можно оценивать Геймдизайн</h2>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Давайте разберемся, как определить плохой геймдизайн. В бытовых дискуссиях под плохим гейм дизайном игрок чаще всего подразумевает дизайн, который ему не нравится.Не нравится потому что скучно, не увлекает или, мое самое любимое, не работает.Но на деле, все, разумеется, несколько сложнее.В вопросе оценки качества гейм дизайна крайне важно отделить субъективную составляющую от объективной.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Такой популярный критерий как, скажем, скука, является совершенно субъективным. кому-то предельно не интересно давить грязь на грузовиках в условной модранер, а кто-то ловит от этого процесса дикий кайф. Кто-то терпеть не может наворачивать круги в гоночных играх, а кого-то просто невозможно оторвать от Проджект карс и Форзы. Кто-то вообще не понимает, зачем тыкаться в какие-то контурные карты, а кто-то прочувствовал всю магию стратегий и теперь во всю наслаждается процессом. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Так как же понять, на сколько хорошо или плохо гейм дизайнер справился со своей задачей, если восприятие игр настолько субъективно? </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Сейчас слушайте внимательно, важно понять на сколько игровые механики отвечают тем целям, что ставит перед собой игра. Цели могут быть совершенно разнообразными: подарить игроку адреналиновые ощущения, напугать его, заставить геймера напрячь мозг, вызвать бурю драматических эмоций, подарить ощущение всесилия или наоборот, загнать игрока в угол и вынудить его принимать сложные решения, испытывая при этом тревогу. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Вопреки расхожему предубеждению игры не ограничиваются банальной целью - радовать. Они способны приносить самые разнообразные эмоции. Стоит заметить, что над созданием эмоционального отклика должна работать вся игра в целом. а геймплей лишь один из инструментов формирования этого отклика, хоть и безумно важный. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 С другой стороны у каждого геймплейного элемента есть и чисто функциональная цель. К примеру механика перемещения позволяет игроку банально передвигаться по игровому миру. Механики по сути дают игроку главную возможность в играх, возможность активно действовать и то, как именно будет протекать процесс этого действия во многом зависит от геймдизайнера, а если мы хотим подарить геймеру опыт скоростного или вертикального перемещения, мы создаем более свободную паркур механику. А если мы хоти приземлить игрока и предать его движениям веса, то работать предстоит уже в другом направлении. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 И вот эта функциональная цель связанная с реализацией некоего конкретного действия игроком, для геймдизайнера зачастую бывает даже более важна, чем эмоциональная. Надо понимать, что гейм дизайнеру достаточно сложно манипулировать эмоциями напрямую, он, в первую очередь, создает игровой опыт, а уже хорошо продуманный и правильно реализованный экспириенс поможет вызвать у аудитории нужные эмоции. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Важно понять, какой игровой опыт хочет создать та или иная игра. Исходя из ее жанровой принадлежности, сеттинга, тональности, сложности и других факторов. И уже исходя от этого прикидывать насколько хорошо она справляется со своей задачей. Опять же, желательно оценить, кто является для игры целевой аудиторией, чтобы лучше осознавать насколько гейм дизайнер хорошо или плохо понимает своего игрока. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Короче говоря, геймдизайнер не существует без конкретной цели, контекста и аудитории, для которых он предназначен. Более того, одно и тоже гейм дизайнерское решение может просто прекрасно смотреться в одной игре, но при этом может быть совершенно неуместным для какой-нибудь другой.</a>
						</p>
					</div>
					<div class='container-tx1-block darkmode-txt'>
						<h2>Загадка летающего коня</h2>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Вот пример, в Ассасинс крид Одиссей конь способен падать с большой высоты и при этом каким-то образом выживать. Потому что очевидно древнегреческие наномашины.А само парнокопытные - это лишь безымянное, абсолютно функциональное средство передвижения. Подобная условность сделана лишь для того, чтобы сделать процесс перемещения по открытому миру игры более комфортным для игрока. В добавок сама Одиссея это игра в полумифическом сэттинге, где на фоне остального бреда, бессмертная лошадь вызывает не так уж и много вопросов. Ну бессмертная и бессмертная, чего бубнить-то. Тут у протагониста магическое копье долбит врагов по аое и раскидывает их на десятки метров. Она потомок царя Леонида, древние технологии ису, И да, здешняя лошадь все же не до конца бессмертна, но все же, чтобы ее угробить - нужно намеренно стараться.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 С другой стороны ред дед редемшен 2 уделяет вашему парнокопытному спутнику гораздо больше внимания.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Вы даете лошади имя и куда более тонко контролируете процесс перемещения верхом. Особенно при помощи геймпада. Это другой набор механик, в рамках другого, существенно более приземленного сетинга. Так что в РДР 2 от падения с высоты лошади склонны отбрасывать копыта. Кстати, это не смешно, это очень грустно. Я плакал. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Так вот. Около Бессмертная лошадь в рдр 2 смотрелась бы глупо, не говоря уже о том, что она бы просто не гармонировала бы с другими механиками и в целом выбивалась бы из рамок сеттинга. Хотя сам процесс передвижения стал бы куда комфортнее для игрока. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Дело в том, что цель ассасинс крид одисси сделать перемещение игрока по колоссальному открытому миру удобным и функциональным, в то же время цель рдр 2 сделать перемещение вовлекающим, дать игроку больше контроля, сделать связь между игроком и его скакуном. Конь в РДР 2 - это не только функция, а и в какой-то степени персонаж. А в Ассасинс Крид просто функция, важно понимать, что это ни хорошо и ни плохо, просто игры делают разные акценты. И оба решения проблемы падающего коня имею право на существования. Конечно, кто-то скажет, что продвинутая система перемещения и ухода за своим конем в рдр 2 - это несомненно более красивое и элегантное решение. Но потом у игрока появляется вполне реальная необходимость пересечь на своем мустанге вполне большую территорию.И регулярно долбя по кнопке Х, попутно врезаясь в деревья, периодически падая и сталкиваясь с необходимостью постоянно подкармливать свою лошадку игрок успеет ни раз проклясть эти чертовы элементы реализма. Конь в рдр 2 более настоящий, это правда, но и фрустрирует он в случае чего, гораздо быстрее, чем чисто функциональная машина из Ассасин крид.</a>
						</p>
					</div>
					<div class='container-tx1-block darkmode-txt'>
						<h2>Контекст важен</h2>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Но что если реализм вас вовсе не раздражает, а развлекает? Мы приходим к тому, что восприятие всегда субъективно.  Если вы любите комфорт в играх - вам понравится одно решение, если же вы готовы пожертвовать комфортом ради погружения, то другое.  Так что для более-менее объективной оценки механики нужно знать ее контекст. По словам опытных гейм дизайнеров нет ничего хуже, когда некая система существует в отрыве от самой игры. </a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Рассмотрим на примере Вол Раннинга.В игре Титанфол 2 это по-настоящему нужная механика. Она расширяет тактический диапазон игрока, а сама механика обладает разной глубиной, что провоцирует игрока изучить ее глубже, чтобы получать какие-либо преимущества. С другой стороны аналогичная механика в Колл Оф Дюти Инфинит Ворфеир ощущается совершенно гимиковой. Этакая одноразовая игрушка. Ее можно применять, но не во всех местах, да и то не всегда. Какой-либо окрыляющей свободы она не дает. Разница между этими механиками заключается в том, что карты в Колл Оф Дюти совершенно не предназначены для использования этой самой механики.</a>
						</p>
					</div>
					<p><br>
					<div class='container-tx2-block darkmode-txt'>
						<p>
							 Итак мы определились, что при оценивании уровня качества  гейм дизайна очень важно понять его цели и контекст. Так сказать разобраться с тем, в какую игру он помещен, на сколько хорошо игровой процесс гармонирует с окружением, УЖЕ ЗАТЕМ МОЖНО ОЦЕНИТЬ В КАКОЙ СТЕПЕНИ ТА ИЛИ ИНАЯ МЕХАНИКА приуспевает в создании задуманного игрового опыта, то есть оценить уровень качества исполнения этой самой механики. Идея за механикой может стоять просто фантастическая, но важно правильно ее реализовать.</a>
						</p>
					</div>
									
					
					
				</div>
			</div>
			
	<?php include 'lib/module/ui-main-footer.php';?>
</div>
</body>
</html>